# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'mongodb/brew'
# tap 'nicoverbruggen/homebrew-cask'

# Binaries
# brew 'awscli'
# brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
# brew 'gh'
brew 'git'
brew 'blueutil'
# brew 'gnupg'
# brew 'grep'
# brew 'httpie'
# brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mongodb-community@4.4'
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe/stripe-cli/stripe'
# brew 'svn'
# brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
# brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'php'
# brew 'php@7.4'
# brew 'php@7.3'
# brew 'composer'
# brew 'imagemagick'
# brew 'libmemcached'
# brew 'meilisearch'
# brew 'memcached'
# brew 'mysql'
# brew 'nginx'
# brew 'node'
# brew 'redis'
# brew 'yarn'
# brew 'nvm' # Brew install is not supported by NVM

# Apps
# cask '1password'
# cask '1password-cli'
# cask 'aerial'
cask 'alfred'
# cask 'caffeine'
# cask 'dbngin'
# cask 'discord'
# cask 'docker'
cask 'drawio'
# cask 'dropbox'
# cask 'figma'
cask 'firefox'
# cask 'github'
# cask 'google-backup-and-sync'
cask 'google-chrome'
# cask 'gpg-suite'
# cask 'imageoptim'
# cask 'insomnia'
cask "iterm2"
# cask 'phpmon'
# cask 'phpstorm'
# cask 'ray'
cask 'rectangle'
cask 'sequel-pro'
# cask 'screenflow'
# cask 'signal'
cask 'slack'
cask 'spotify'
# cask 'sublime-text'
# cask 'tableplus'
# cask 'telegram-desktop'
# cask 'the-unarchiver'
# cask 'tinkerwell'
# cask 'transmission'
# cask 'transmit'
# cask 'tunnelbear'
# cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store TODO put mas install in a separate file
# mas install 409183694
# mas install 409203825
# mas install 409201541
# mas install 937984704
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Spark', id: 1176895641
# mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696
